var x;
var y;
var z;

// example 1

x = 6;
y = 14;
z = 4;

x += y - x++ * z;
 
/*

1) постфіксний інкремент, х++ = 6

2) операція множення [x](6)*[z](4) = 24

3) арифметична операція віднімання ([y](14)-[результат дії 2](24)=-10

4) присвоювання з додаванням 6 + (-10) = -4

*/ 

console.log("ex. 1, x = ", x); // -4


// example 2

x = 6;
y = 14;
z = 4;

z = --x - y * 5;
 
/*

1) префіксний декремент --x (x=5)

2) операція множення [y](14)*5 = 70

3) арифметична дія 5-70 = -65

*/ 

console.log("ex. 2, z = ", z); // -65


// example 3

x = 6;
y = 14;
z = 4;

y /= x + 5 % z;
 
/*

1) остача від ділення 5 % z = 1

2) операція додавання [х](6) + 1 = 7

3) присвоєння з діленням 14 / 7 = 2

*/ 

console.log("ex. 3, y = ", y); // 2

// example 4

x = 6;
y = 14;
z = 4;

console.log("ex.4 expression = ",z - x++ + y * 5); // 68

 
/*

1) постфіксний інкремент х++ = 6

2) операція множення y*5 = 70

3) арифметичні дії 4 - 6 = -2 + 70 = 68

*/ 

// example 5

x = 6;
y = 14;
z = 4;

x = y - x++ * z
 
/*

1) постфіксний інкремент х++ = 6

2) операція множення [х](6) * [z](4) = 24

3) операція віднімання [y](14) - 24 = -10

*/ 

console.log("ex. 5, x = ", x); // -10